export const dataConstructor = [
        {
            name: 'Вариант кухни',
            code:
                'type',
            specifications:
                [
                    {
                        type: 'tags',
                        code: 'class',
                        name: 'Класс',
                        tags: [
                            'Standard'
                        ]
                    },
                    {
                        code: 'powerConsumption',
                        name: 'Потребляемая мощность',
                        desc: '59 Вт'
                    },
                    {
                        code: 'powerOfLight',
                        name: 'Сила света',
                        desc: '3459 Люмен = 7,5 ламп накаливания по 40 Вт.'
                    },
                    {
                        code: 'guarantee',
                        name: 'Гарантия',
                        desc: '3 года'
                    },
                    {
                        code: 'mounting',
                        name: 'Монтаж',
                        desc: 'Да'
                    },
                    {
                        code: 'sumTotal',
                        name: 'Итого сумма',
                        desc: '2594 рублей'
                    },
                ],
            slider:
                [
                    {
                        name: 'Теплый',
                        code: 'warm'
                    },
                    {
                        name: 'Дневной',
                        code: 'day'
                    },
                    {
                        name: 'Холодный',
                        code: 'cold'
                    }
                ],
            alert:
                {
                    name: 'Выберите цвет свечения',
                    desc:
                        [
                            '"Casual" - это свободный и динамичный стиль, причем он используется не только в одежде, но и в интерьере.' +
                            'На рабочем месте это правильное распределение пространства, удобная деревянная мебель, натуральные ткани, а дома, в вашей квартире' +
                            '- это, в первую очередь, удобство и уют и много свободного пространства',
                            'Простым решением для вашей прихожей может быть система крючков, установленных на жеревянной плите или натянутая ' +
                            'сетка, на которую можно вешать все, что угодно: обувь за каблуки, сумки, зонты, пакеты, одежду. Причем, ' +
                            'даже дети спокойно справятся с этой задачей сами, если крючки или сетку разместить до самого пола.',
                            'Кухня в стили "casual" = это, конечно, дерево. Хотя подойдет и пластик, если вы дополните интерьер ' +
                            'клетчатыми, полосатыми, в горошек или в цветочек шторами и скатертью. Можно украсить по вашему разумению ' +
                            'множеством разноцвветных деталей: кружечек, баночек, плошек. Только не переуседствуйте, ведь "casual", ' +
                            'прежде всего свобода, простор, а не помещение плотно забитое вещами.'
                        ]
                }
        }
        ,
        {
            name: 'Размеры',
            code:
                'size',
            specifications:
                [
                    {
                        type: 'tags',
                        code: 'class',
                        name: 'Класс',
                        tags: [
                            'Standard'
                        ]
                    },
                    {
                        code: 'powerConsumption',
                        name: 'Потребляемая мощность',
                        desc: '59 Вт'
                    },
                    {
                        code: 'powerOfLight',
                        name: 'Сила света',
                        desc: '3459 Люмен = 7,5 ламп накаливания по 40 Вт.'
                    },
                    {
                        code: 'guarantee',
                        name: 'Гарантия',
                        desc: '3 года'
                    },
                    {
                        code: 'mounting',
                        name: 'Монтаж',
                        desc: 'Да'
                    },
                    {
                        code: 'sumTotal',
                        name: 'Итого сумма',
                        desc: '2594 рублей'
                    },
                ],
            slider:
                [
                    {
                        name: 'Теплый',
                        code: 'warm'
                    },
                    {
                        name: 'Дневной',
                        code: 'day'
                    },
                    {
                        name: 'Холодный',
                        code: 'cold'
                    }
                ],
            alert:
                {
                    name: 'Выберите цвет свечения',
                    desc:
                        [
                            '"Casual" - это свободный и динамичный стиль, причем он используется не только в одежде, но и в интерьере.' +
                            'На рабочем месте это правильное распределение пространства, удобная деревянная мебель, натуральные ткани, а дома, в вашей квартире' +
                            '- это, в первую очередь, удобство и уют и много свободного пространства',
                            'Простым решением для вашей прихожей может быть система крючков, установленных на жеревянной плите или натянутая ' +
                            'сетка, на которую можно вешать все, что угодно: обувь за каблуки, сумки, зонты, пакеты, одежду. Причем, ' +
                            'даже дети спокойно справятся с этой задачей сами, если крючки или сетку разместить до самого пола.',
                            'Кухня в стили "casual" = это, конечно, дерево. Хотя подойдет и пластик, если вы дополните интерьер ' +
                            'клетчатыми, полосатыми, в горошек или в цветочек шторами и скатертью. Можно украсить по вашему разумению ' +
                            'множеством разноцвветных деталей: кружечек, баночек, плошек. Только не переуседствуйте, ведь "casual", ' +
                            'прежде всего свобода, простор, а не помещение плотно забитое вещами.'
                        ]
                }
        }
        ,
        {
            name: 'Сенсор',
            code:
                'sensory',
            specifications:
                [
                    {
                        type: 'tags',
                        code: 'class',
                        name: 'Класс',
                        tags: [
                            'Standard'
                        ]
                    },
                    {
                        code: 'powerConsumption',
                        name: 'Потребляемая мощность',
                        desc: '59 Вт'
                    },
                    {
                        code: 'powerOfLight',
                        name: 'Сила света',
                        desc: '3459 Люмен = 7,5 ламп накаливания по 40 Вт.'
                    },
                    {
                        code: 'guarantee',
                        name: 'Гарантия',
                        desc: '3 года'
                    },
                    {
                        code: 'mounting',
                        name: 'Монтаж',
                        desc: 'Да'
                    },
                    {
                        code: 'sumTotal',
                        name: 'Итого сумма',
                        desc: '2594 рублей'
                    },
                ],
            slider:
                [
                    {
                        name: 'Теплый',
                        code: 'warm'
                    },
                    {
                        name: 'Дневной',
                        code: 'day'
                    },
                    {
                        name: 'Холодный',
                        code: 'cold'
                    }
                ],
            alert:
                {
                    name: 'Выберите цвет свечения',
                    desc:
                        [
                            '"Casual" - это свободный и динамичный стиль, причем он используется не только в одежде, но и в интерьере.' +
                            'На рабочем месте это правильное распределение пространства, удобная деревянная мебель, натуральные ткани, а дома, в вашей квартире' +
                            '- это, в первую очередь, удобство и уют и много свободного пространства',
                            'Простым решением для вашей прихожей может быть система крючков, установленных на жеревянной плите или натянутая ' +
                            'сетка, на которую можно вешать все, что угодно: обувь за каблуки, сумки, зонты, пакеты, одежду. Причем, ' +
                            'даже дети спокойно справятся с этой задачей сами, если крючки или сетку разместить до самого пола.',
                            'Кухня в стили "casual" = это, конечно, дерево. Хотя подойдет и пластик, если вы дополните интерьер ' +
                            'клетчатыми, полосатыми, в горошек или в цветочек шторами и скатертью. Можно украсить по вашему разумению ' +
                            'множеством разноцвветных деталей: кружечек, баночек, плошек. Только не переуседствуйте, ведь "casual", ' +
                            'прежде всего свобода, простор, а не помещение плотно забитое вещами.'
                        ]
                }
        }
        ,
        {
            name: 'Питающий кабель',
            code:
                'cable',
            specifications:
                [
                    {
                        type: 'tags',
                        code: 'class',
                        name: 'Класс',
                        tags: [
                            'Standard'
                        ]
                    },
                    {
                        code: 'powerConsumption',
                        name: 'Потребляемая мощность',
                        desc: '59 Вт'
                    },
                    {
                        code: 'powerOfLight',
                        name: 'Сила света',
                        desc: '3459 Люмен = 7,5 ламп накаливания по 40 Вт.'
                    },
                    {
                        code: 'guarantee',
                        name: 'Гарантия',
                        desc: '3 года'
                    },
                    {
                        code: 'mounting',
                        name: 'Монтаж',
                        desc: 'Да'
                    },
                    {
                        code: 'sumTotal',
                        name: 'Итого сумма',
                        desc: '2594 рублей'
                    },
                ],
            slider:
                [
                    {
                        name: 'Теплый',
                        code: 'warm'
                    },
                    {
                        name: 'Дневной',
                        code: 'day'
                    },
                    {
                        name: 'Холодный',
                        code: 'cold'
                    }
                ],
            alert:
                {
                    name: 'Выберите цвет свечения',
                    desc:
                        [
                            '"Casual" - это свободный и динамичный стиль, причем он используется не только в одежде, но и в интерьере.' +
                            'На рабочем месте это правильное распределение пространства, удобная деревянная мебель, натуральные ткани, а дома, в вашей квартире' +
                            '- это, в первую очередь, удобство и уют и много свободного пространства',
                            'Простым решением для вашей прихожей может быть система крючков, установленных на жеревянной плите или натянутая ' +
                            'сетка, на которую можно вешать все, что угодно: обувь за каблуки, сумки, зонты, пакеты, одежду. Причем, ' +
                            'даже дети спокойно справятся с этой задачей сами, если крючки или сетку разместить до самого пола.',
                            'Кухня в стили "casual" = это, конечно, дерево. Хотя подойдет и пластик, если вы дополните интерьер ' +
                            'клетчатыми, полосатыми, в горошек или в цветочек шторами и скатертью. Можно украсить по вашему разумению ' +
                            'множеством разноцвветных деталей: кружечек, баночек, плошек. Только не переуседствуйте, ведь "casual", ' +
                            'прежде всего свобода, простор, а не помещение плотно забитое вещами.'
                        ]
                }
        }
        ,
        {
            name: 'Блок питания',
            code:
                'pcu',
            specifications:
                [
                    {
                        type: 'tags',
                        code: 'class',
                        name: 'Класс',
                        tags: [
                            'Standard'
                        ]
                    },
                    {
                        code: 'powerConsumption',
                        name: 'Потребляемая мощность',
                        desc: '59 Вт'
                    },
                    {
                        code: 'powerOfLight',
                        name: 'Сила света',
                        desc: '3459 Люмен = 7,5 ламп накаливания по 40 Вт.'
                    },
                    {
                        code: 'guarantee',
                        name: 'Гарантия',
                        desc: '3 года'
                    },
                    {
                        code: 'mounting',
                        name: 'Монтаж',
                        desc: 'Да'
                    },
                    {
                        code: 'sumTotal',
                        name: 'Итого сумма',
                        desc: '2594 рублей'
                    },
                ],
            slider:
                [
                    {
                        name: 'Теплый',
                        code: 'warm'
                    },
                    {
                        name: 'Дневной',
                        code: 'day'
                    },
                    {
                        name: 'Холодный',
                        code: 'cold'
                    }
                ],
            alert:
                {
                    name: 'Выберите цвет свечения',
                    desc:
                        [
                            '"Casual" - это свободный и динамичный стиль, причем он используется не только в одежде, но и в интерьере.' +
                            'На рабочем месте это правильное распределение пространства, удобная деревянная мебель, натуральные ткани, а дома, в вашей квартире' +
                            '- это, в первую очередь, удобство и уют и много свободного пространства',
                            'Простым решением для вашей прихожей может быть система крючков, установленных на жеревянной плите или натянутая ' +
                            'сетка, на которую можно вешать все, что угодно: обувь за каблуки, сумки, зонты, пакеты, одежду. Причем, ' +
                            'даже дети спокойно справятся с этой задачей сами, если крючки или сетку разместить до самого пола.',
                            'Кухня в стили "casual" = это, конечно, дерево. Хотя подойдет и пластик, если вы дополните интерьер ' +
                            'клетчатыми, полосатыми, в горошек или в цветочек шторами и скатертью. Можно украсить по вашему разумению ' +
                            'множеством разноцвветных деталей: кружечек, баночек, плошек. Только не переуседствуйте, ведь "casual", ' +
                            'прежде всего свобода, простор, а не помещение плотно забитое вещами.'
                        ]
                }
        }
        ,
        {
            name: 'Цвет свечения',
            code:
                'glowColor',
            specifications:
                [
                    {
                        type: 'tags',
                        code: 'class',
                        name: 'Класс',
                        tags: [
                            'Standard'
                        ]
                    },
                    {
                        code: 'powerConsumption',
                        name: 'Потребляемая мощность',
                        desc: '59 Вт'
                    },
                    {
                        code: 'powerOfLight',
                        name: 'Сила света',
                        desc: '3459 Люмен = 7,5 ламп накаливания по 40 Вт.'
                    },
                    {
                        code: 'guarantee',
                        name: 'Гарантия',
                        desc: '3 года'
                    },
                    {
                        code: 'mounting',
                        name: 'Монтаж',
                        desc: 'Да'
                    },
                    {
                        code: 'sumTotal',
                        name: 'Итого сумма',
                        desc: '2594 рублей'
                    },
                ],
            slider:
                [
                    {
                        name: 'Теплый',
                        code: 'warm',
                        gallery: ['slide1', 'slide2', 'slide3']
                    },
                    {
                        name: 'Дневной',
                        code: 'day',
                        gallery: ['slide1', 'slide2', 'slide3']
                    },
                    {
                        name: 'Холодный',
                        code: 'cold',
                        gallery: ['slide1', 'slide2', 'slide3']
                    }
                ],
            alert:
                {
                    name: 'Выберите цвет свечения',
                    desc:
                        [
                            '"Casual" - это свободный и динамичный стиль, причем он используется не только в одежде, но и в интерьере.' +
                            'На рабочем месте это правильное распределение пространства, удобная деревянная мебель, натуральные ткани, а дома, в вашей квартире' +
                            '- это, в первую очередь, удобство и уют и много свободного пространства',
                            'Простым решением для вашей прихожей может быть система крючков, установленных на жеревянной плите или натянутая ' +
                            'сетка, на которую можно вешать все, что угодно: обувь за каблуки, сумки, зонты, пакеты, одежду. Причем, ' +
                            'даже дети спокойно справятся с этой задачей сами, если крючки или сетку разместить до самого пола.',
                            'Кухня в стили "casual" = это, конечно, дерево. Хотя подойдет и пластик, если вы дополните интерьер ' +
                            'клетчатыми, полосатыми, в горошек или в цветочек шторами и скатертью. Можно украсить по вашему разумению ' +
                            'множеством разноцвветных деталей: кружечек, баночек, плошек. Только не переуседствуйте, ведь "casual", ' +
                            'прежде всего свобода, простор, а не помещение плотно забитое вещами.'
                        ]
                }
        }
        ,
        {
            name: 'Монтаж',
            code:
                'mounting',
            specifications:
                [
                    {
                        type: 'tags',
                        code: 'class',
                        name: 'Класс',
                        tags: [
                            'Standard'
                        ]
                    },
                    {
                        code: 'powerConsumption',
                        name: 'Потребляемая мощность',
                        desc: '59 Вт'
                    },
                    {
                        code: 'powerOfLight',
                        name: 'Сила света',
                        desc: '3459 Люмен = 7,5 ламп накаливания по 40 Вт.'
                    },
                    {
                        code: 'guarantee',
                        name: 'Гарантия',
                        desc: '3 года'
                    },
                    {
                        code: 'mounting',
                        name: 'Монтаж',
                        desc: 'Да'
                    },
                    {
                        code: 'sumTotal',
                        name: 'Итого сумма',
                        desc: '2594 рублей'
                    },
                ],
            slider:
                [
                    {
                        name: 'Теплый',
                        code: 'warm'
                    },
                    {
                        name: 'Дневной',
                        code: 'day'
                    },
                    {
                        name: 'Холодный',
                        code: 'cold'
                    }
                ],
            alert:
                {
                    name: 'Выберите цвет свечения',
                    desc:
                        [
                            '"Casual" - это свободный и динамичный стиль, причем он используется не только в одежде, но и в интерьере.' +
                            'На рабочем месте это правильное распределение пространства, удобная деревянная мебель, натуральные ткани, а дома, в вашей квартире' +
                            '- это, в первую очередь, удобство и уют и много свободного пространства',
                            'Простым решением для вашей прихожей может быть система крючков, установленных на жеревянной плите или натянутая ' +
                            'сетка, на которую можно вешать все, что угодно: обувь за каблуки, сумки, зонты, пакеты, одежду. Причем, ' +
                            'даже дети спокойно справятся с этой задачей сами, если крючки или сетку разместить до самого пола.',
                            'Кухня в стили "casual" = это, конечно, дерево. Хотя подойдет и пластик, если вы дополните интерьер ' +
                            'клетчатыми, полосатыми, в горошек или в цветочек шторами и скатертью. Можно украсить по вашему разумению ' +
                            'множеством разноцвветных деталей: кружечек, баночек, плошек. Только не переуседствуйте, ведь "casual", ' +
                            'прежде всего свобода, простор, а не помещение плотно забитое вещами.'
                        ]
                }
        }
        ,
        {
            name: 'Корзина',
            code:
                'basket',
            specifications:
                [
                    {
                        type: 'tags',
                        code: 'class',
                        name: 'Класс',
                        tags: [
                            'Standard'
                        ]
                    },
                    {
                        code: 'powerConsumption',
                        name: 'Потребляемая мощность',
                        desc: '59 Вт'
                    },
                    {
                        code: 'powerOfLight',
                        name: 'Сила света',
                        desc: '3459 Люмен = 7,5 ламп накаливания по 40 Вт.'
                    },
                    {
                        code: 'guarantee',
                        name: 'Гарантия',
                        desc: '3 года'
                    },
                    {
                        code: 'mounting',
                        name: 'Монтаж',
                        desc: 'Да'
                    },
                    {
                        code: 'sumTotal',
                        name: 'Итого сумма',
                        desc: '2594 рублей'
                    },
                ],
            slider:
                [
                    {
                        name: 'Теплый',
                        code: 'warm'
                    },
                    {
                        name: 'Дневной',
                        code: 'day'
                    },
                    {
                        name: 'Холодный',
                        code: 'cold'
                    }
                ],
            alert:
                {
                    name: 'Выберите цвет свечения',
                    desc:
                        [
                            '"Casual" - это свободный и динамичный стиль, причем он используется не только в одежде, но и в интерьере.' +
                            'На рабочем месте это правильное распределение пространства, удобная деревянная мебель, натуральные ткани, а дома, в вашей квартире' +
                            '- это, в первую очередь, удобство и уют и много свободного пространства',
                            'Простым решением для вашей прихожей может быть система крючков, установленных на жеревянной плите или натянутая ' +
                            'сетка, на которую можно вешать все, что угодно: обувь за каблуки, сумки, зонты, пакеты, одежду. Причем, ' +
                            'даже дети спокойно справятся с этой задачей сами, если крючки или сетку разместить до самого пола.',
                            'Кухня в стили "casual" = это, конечно, дерево. Хотя подойдет и пластик, если вы дополните интерьер ' +
                            'клетчатыми, полосатыми, в горошек или в цветочек шторами и скатертью. Можно украсить по вашему разумению ' +
                            'множеством разноцвветных деталей: кружечек, баночек, плошек. Только не переуседствуйте, ведь "casual", ' +
                            'прежде всего свобода, простор, а не помещение плотно забитое вещами.'
                        ]
                }
        }
    ]
;
